//==========================================================================
//文件名称：reed_switch.c
//功能概要：干簧管应用驱动程序源文件
//==========================================================================

#include "reed_switch.h"

//==========================================================================
//函数名称: reed_switch_init
//函数返回: 无
//参数说明: 无
//功能概要: 初始化干簧管，相应配置在reed_switch.h中
//==========================================================================
void reed_switch_init() {
	//初始化输入引脚
	gpio_init(REED_SWITCH_INPUT, GPIO_DIR_INPUT, REED_SWITCH_INPUT_PULL);
	//初始化输出引脚
	gpio_init(REED_SWITCH_OUTPUT, GPIO_DIR_OUTPUT, REED_SWITCH_OUTPUT_LEVEL);
}

//==========================================================================
//函数名称: reed_switch_enable_int
//函数返回: 无
//参数说明: 无
//功能概要: 使能干簧管输入中断，当有磁铁靠近干簧管时会产生中断，
//         相应的中断服务程序由输入引脚的端口决定，相应配置在reed_switch.h中
//==========================================================================
void reed_switch_enable_int() {
	gpio_enable_int(REED_SWITCH_INPUT, REED_SWITCH_INT_TYPE);
}

//==========================================================================
//函数名称: reed_switch_disable_int
//函数返回: 无
//参数说明: 无
//功能概要: 关闭干簧管输入中断
//==========================================================================
void reed_switch_disable_int() {
	gpio_disable_int(REED_SWITCH_INPUT);
}

//==========================================================================
//函数名称: reed_switch_get_int
//函数返回: true:产生中断; false:未产生中断
//参数说明: 无
//功能概要: 获取干簧管输入中断标志
//==========================================================================
bool reed_switch_get_int() {
	return gpio_get_int(REED_SWITCH_INPUT);
}

//==========================================================================
//函数名称: reed_switch_clear_int
//函数返回: 无
//参数说明: 无
//功能概要: 清除干簧管输入中断标志
//==========================================================================
void reed_switch_clear_int() {
	gpio_clear_int(REED_SWITCH_INPUT);
}
