//==========================================================================
//文件名称：vcan.h
//功能概要：山外多功能调试助手软件程序头文件
//==========================================================================

#ifndef _VCAN_H
#define _VCAN_H

#include "common.h"
#include "uart.h"

//定义所使用的UART模块号，需要使能该模块，才可以使用本文件提供的函数
#define VCAN_UART_MOD	UART_MOD1	//UART1

//定义发送各图像的命令
#define VCAN_CMD_IMG	(1)

//==========================================================================
//函数名称: vcan_send_raw_img
//函数返回: 无
//参数说明: raw_img:原始图像首地址
//功能概要: 在山外多功能调试助手上显示采集的图像信息
//==========================================================================
void vcan_send_raw_img(uint8* raw_img);

//==========================================================================
//函数名称: vcan_send_img
//函数返回: 无
//参数说明: img:图像首地址
//功能概要: 在山外多功能调试助手上显示图像信息
//==========================================================================
void vcan_send_img(uint8* img);

#endif
