//==============================================================
//文件名称：visual_scope.h
//功能概要：串口调试工具头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//==============================================================

#ifndef _VISUAL_SCOPE_H
#define _VISUAL_SCOPE_H

#include "common.h"     //包含公共要素头文件
#include "uart.h"

//============================================================================
//函数名称：visual_scope_output
//参数说明：uartNo:发送的串口号
//		 data_out:想要发送的4个通道的数组指针
//函数返回：无
//功能概要：将四个通道数据加上校验发送出去
//============================================================================
void visual_scope_output(uint8_t uartNo, float data_out[4]);

#endif
