//=====================================================================
//文件名称：isr.c
//功能概要： 中断底层驱动构件源文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2012-11-12   V1.0
//=====================================================================

#include "includes.h"

//========================中断函数服务例程===============================

//=====================================================================
//函数名称：UART2_IRQHandler（串口2接收中断服务例程）
//功能概要：串口2接收一个数据，并将其打出
//=====================================================================
void UART2_IRQHandler(void)
{
	uint_8 ch;
	uint_8 flag = 1;

	DISABLE_INTERRUPTS;

	ch = uart_re1(UART_2, &flag);
	//获取成功
	if (0 == flag)
	{
		//####将收到的指令添加至消息队列中


		//防止越界
		if (g_msg.rear == 16)
		{
			g_msg.rear = 0;
		}
	}

	ENABLE_INTERRUPTS;
}

//==========================================================================
//函数名称：PIT_IRQHandler
//函数返回：无
//参数说明：无
//功能概要：PIT中断服务例程，清中断标志
//调用举例：无
//==========================================================================
void PIT_IRQHandler(void)
{
	//时间计数器
	static TimeCounter time_counter =
	{ 0, 0 };

	DISABLE_INTERRUPTS;

	//####先判断中断源是否为PIT_CH0

		//####是的话清中断标志

		//####增加时间计数器

		//####由于设置的是50ms一个中断，计数器到达相应的数值后置相应的时间标志为1，并重置计数器

	ENABLE_INTERRUPTS;
}
