/*
 * img_deal.h
 *
 *  Created on: 2017年4月17日
 *      Author: Administrator
 */
#include "common.h"
#include "camera.h"

#ifndef _IMG_DEAL_H_
#define _IMG_DEAL_H_

//定义图像宽度
#define IMG_WIDTH	(80)
//定义图像高度
#define IMG_HEIGHT	(60)

//二值化界限
#define BINARY_VALUE 0

//定义筛选行的间隔，建议选择IMG_HEIGHT/3-1，跨度更广
#define IMG_DIVIDE 12

//====================================================================
//函数名称：deal_image
//函数返回：无
//参数说明：无
//功能概要：找出近远两行的中心
//====================================================================
void deal_image(uint8 Image[IMG_HEIGHT][IMG_WIDTH],int16 returnBuff[6]);
//====================================================================
//函数名称：get_image_aimmidpoint
//函数返回：无
//参数说明：无
//功能概要：找出近远两行的中心
//====================================================================
void get_image_midpoint(int16 returnBuff[6],float* midpoint);
//===========================================================================
//函数名称：deal_ccd_line
//函数返回：转向PWM值
//参数说明：point-ccd采集到的数据帧数组
//功能概要：赛道识别算法函数，根据图像信息，得出舵机的PWM相对于舵机打正需要调整的数值
//       具体步骤为：（1）寻找赛道边界
//                （2）对可能存在的图像元素进行判断，分析对应的赛道状况
//                （3）PWM值的确定
//===========================================================================
void deal_ccd_line(uint8 *point,int16 returnBuff[2]);
//===========================================================================
//函数名称：ccd_pix_ave
//函数返回：返回平均值
//参数说明：len：数据长度
//       data：数据存储区
//功能概要：计算128个像素点的平均值
//===========================================================================
uint8 ccd_pix_ave(uint8 len, uint8 * data);

#endif /* 07_SOFT_COMPONENT_IMG_DEAL_IMG_DEAL_H_ */
