//===========================================================================
//文件名称：encoder.h
//功能概要：编码器头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2013-02-02   V2.0
//===========================================================================

#ifndef _ENCODER_H
#define _ENCODER_H

//头文件包含
#include "common.h"    //包含公共要素头文件
#include "gpio.h"      //用到gpio构件

//采样参数=======================================================================
#define ENCODER1		(U_PORTD|0)	//定义接受速度信号的引脚
#define ENCODER2		(U_PORTD|1)
#define ENCODER_PERIOD	(50)		//采样时间间隔，单位ms

//编码器硬件参数===================================================================
#define ENCODER_RES		(500)		//编码器分辨率 (500表示500个脉冲每转)
#define ENCODER_GEAR_R	(8)			//编码器齿轮半径，单位毫米

//============================================================================
//函数名称：encoder_init
//函数参数：port_pin：设定接收速度信号的的引脚，
//          格式为：(端口号)|(引脚号)（如：(U_PORTD)|(1) 表示为D口一号脚）
//函数返回：无
//功能概要：编码器初始化。
//============================================================================
void encoder_init(uint16_t port_pin);

//============================================================================
//函数名称：encoder_get_speed
//函数参数：conter:一个采集周期内编码器脉冲个数
//		 speed:存放该编码器对应轮子速度的指针，单位m/s
//函数返回：无
//功能概要：获得当前速度。
//============================================================================
void encoder_get_speed(uint16_t conter, float *speed);

//============================================================================
//函数名称：encoder_enable_int
//函数参数：port_pin：想要开启中断的引脚，
//          格式为：(端口号)|(引脚号)（如：(U_PORTD)|(1) 表示为D口一号脚）
//函数返回：无
//功能概要：开启引脚中断。
//============================================================================
void encoder_enable_int(uint16_t port_pin);

//============================================================================
//函数名称：encoder_disable_int
//函数参数：port_pin：想要关闭中断的引脚，
//          格式为：(端口号)|(引脚号)（如：(U_PORTD)|(1) 表示为D口一号脚）
//函数返回：无
//功能概要：关闭引脚中断。
//============================================================================
void encoder_disable_int(uint16_t port_pin);

#endif

