//==========================================================================
//文件名称：crc16_modbus.h
//功能概要：CRC16_MODBUS软件程序头文件
//==========================================================================

#ifndef _CRC16_MODBUS_H
#define _CRC16_MODBUS_H

#include "common.h"

//==========================================================================
//说明: 采用MODBUS标准的CRC-16校验，生成多项式为x^16+x^15+x^2+1，简记式为0x8005
//==========================================================================

//定义字节流方式校验数据的初始CRC校验码值
#define CRC16_MODBUS_STREAM_INIT_CRC	(0xFFFF)

//==========================================================================
//函数名称: crc16_modbus_block
//函数返回: 16位的CRC校验码
//参数说明: data:校验数据的首地址
//         len:校验数据的字节数
//功能概要: 校验一定长度的数据，返回生成的16位CRC校验码
//==========================================================================
uint16 crc16_modbus_block(uint8* data, uint32 len);

//==========================================================================
//函数名称: crc16_modbus_stream
//函数返回: 新生成的16位CRC校验码
//参数说明: last_crc:上一次的CRC校验码
//         data:校验数据
//功能概要: 以字节流的方式校验数据，返回新生成的16位CRC校验码
//备注: 首次校验时，last_crc为 CRC16_MODBUS_STREAM_INIT_CRC(0xFFFF);
//     进行流校验时，先校验先收到的数据
//==========================================================================
uint16 crc16_modbus_stream(uint16 last_crc, uint8 data);

#endif
