//==========================================================================
//文件名称：pit.h
//功能概要：K64 PIT底层驱动程序源文件
//==========================================================================

#include "pit.h"

//PIT模块各通道的中断请求号
static const IRQn_Type pit_irq_table[4] = { PIT0_IRQn, PIT1_IRQn, PIT2_IRQn,
		PIT3_IRQn };

//==========================================================================
//函数名称: pit_init
//函数返回: 无
//参数说明: ch:PIT通道号:
//            PIT_CHx，x为通道号;
//         ms:该通道产生中断的时间周期，单位ms，范围[1,89478]
//功能概要: PIT模块通道初始化，默认关闭中断
//==========================================================================
void pit_init(uint8 ch, uint32 ms) {
	uint32 load_value;		//该通道加载值寄存器的值

	REG_SET_MASK(SIM_SCGC6, SIM_SCGC6_PIT_MASK);	//开PIT时钟门
	REG_CLR_MASK(PIT_MCR, PIT_MCR_MDIS_MASK);		//PIT模块定时器时钟使能
	REG_SET_MASK(PIT_MCR, PIT_MCR_FRZ_MASK);		//在调试模式下定时器停止
	load_value = PIT_WORK_FREQ * ms - 1;	//根据产生中断的时间周期计算加载值寄存器的值
	REG_SET_VAL(PIT_LDVAL(ch), load_value);			//设置该通道加载值寄存器的值
	REG_CLR_MASK(PIT_TCTRL(ch), PIT_TCTRL_TIE_MASK);	//禁止该通道发送中断请求
	REG_SET_MASK(PIT_TCTRL(ch), PIT_TCTRL_TEN_MASK);	//该通道定时器时钟使能
}

//==========================================================================
//函数名称: pit_enable_int
//函数返回: 无                                              
//参数说明: ch:PIT通道号:
//            PIT_CHx，x为通道号;
//功能概要: 使能PIT通道中断
//==========================================================================
void pit_enable_int(uint8 ch) {
	REG_SET_MASK(PIT_TFLG(ch), PIT_TFLG_TIF_MASK);	//先清除该通道中断标志，以防止使能中断后立即产生中断
	REG_SET_MASK(PIT_TCTRL(ch), PIT_TCTRL_TIE_MASK);	//允许该通道发送中断请求
	ENABLE_IRQ(pit_irq_table[ch]);						//允许接收该通道发送的中断请求
}

//==========================================================================
//函数名称: pit_disable_int
//函数返回: 无                                              
//参数说明: ch:PIT通道号:
//            PIT_CHx，x为通道号;
//功能概要: 关闭PIT通道中断
//==========================================================================
void pit_disable_int(uint8 ch) {
	REG_CLR_MASK(PIT_TCTRL(ch), PIT_TCTRL_TIE_MASK);	//禁止该通道发送中断请求
	DISABLE_IRQ(pit_irq_table[ch]);						//禁止接收该通道发送的中断请求
}

//==========================================================================
//函数名称: pit_get_int
//函数返回: true:该通道产生中断; false:该通道未产生中断
//参数说明: ch:PIT通道号:
//            PIT_CHx，x为通道号;
//功能概要: 获取PIT通道中断标志
//==========================================================================
bool pit_get_int(uint8 ch) {
	//获取该通道定时器标志寄存器中中断标志的值，并根据值判断是否产生中断
	return (REG_GET_MASK(PIT_TFLG(ch), PIT_TFLG_TIF_MASK)) ? true : false;
}

//==========================================================================
//函数名称: pit_disable_int
//函数返回: 无
//参数说明: ch:PIT通道号:
//            PIT_CHx，x为通道号;
//功能概要: 清除PIT通道中断标志
//==========================================================================
void pit_clear_int(uint8 ch) {
	REG_SET_MASK(PIT_TFLG(ch), PIT_TFLG_TIF_MASK);	//清除该通道中断标志
}

//==========================================================================
//函数名称: pit_get_time_us
//函数返回: 定时器当前时间，单位μs
//参数说明: ch:PIT通道号:
//            PIT_CHx，x为通道号;
//功能概要: 获取定时器当前时间，单位μs
//备注: 当前时间上限为中断周期;
//     可以利用该函数获知代码执行时间，具体如下:
//     调用一次该函数，获取time1;
//     执行一段代码;
//     调用一次该函数，获取time2;
//     由(time2 - time1)可知代码执行时间;
//     若结果小于0，说明执行代码期间定时器到达了中断周期，为结果补上若干中断周期即可;
//     另外，若执行代码期间发生中断，会额外附加处理中断时间
//==========================================================================
uint32 pit_get_time_us(uint8 ch) {
	return (PIT_LDVAL(ch) - PIT_CVAL(ch)) / (PIT_WORK_FREQ / 1000);
}

//==========================================================================
//函数名称: pit_get_time_ms
//函数返回: 定时器当前时间，单位ms
//参数说明: ch:PIT通道号:
//            PIT_CHx，x为通道号;
//功能概要: 获取定时器当前时间，单位ms
//备注: 当前时间上限为中断周期;
//     可以利用该函数获知代码执行时间，具体如下:
//     调用一次该函数，获取time1;
//     执行一段代码;
//     调用一次该函数，获取time2;
//     由(time2 - time1)可知代码执行时间;
//     若结果小于0，说明执行代码期间定时器到达了中断周期，为结果补上若干中断周期即可;
//     另外，若执行代码期间发生中断，会额外附加处理中断时间
//==========================================================================
uint32 pit_get_time_ms(uint8 ch) {
	return pit_get_time_us(ch) / 1000;
}

//==========================================================================
//函数名称: pit_delay_us
//函数返回: 无
//参数说明: ch:PIT通道号:
//            PIT_CHx，x为通道号;
//         us:延时时间，单位μs
//功能概要: 延时一段时间，单位μs
//备注: 延时时间上限为中断周期;
//     若延时期间发生中断，处理中断时间会包含在延时时间中
//==========================================================================
void pit_delay_us(uint8 ch, uint32 us) {
	uint32 start, end;	//开始和结束时CVAL寄存器的值

	//获取开始时CVAL寄存器的值
	start = PIT_CVAL(ch);
	//计算结束时CVAL寄存器的值
	end = start - (uint32) (us * (PIT_WORK_FREQ / 1000));
	//若发生下溢
	if (end > start) {
		//重新计算结束时CVAL寄存器的值
		end = PIT_LDVAL(ch) - (0xFFFFFFFF - end);
		//等待CVAL寄存器减至0
		while (PIT_CVAL(ch) <= end) {
		}
	}
	//等待CVAL寄存器到达结束值
	while (PIT_CVAL(ch) > end) {
	}
}

//==========================================================================
//函数名称: pit_delay_ms
//函数返回: 无
//参数说明: ch:PIT通道号:
//            PIT_CHx，x为通道号;
//         ms:延时时间，单位ms
//功能概要: 延时一段时间，单位ms
//备注: 延时时间上限为中断周期;
//     若延时期间发生中断，处理中断时间会包含在延时时间中
//==========================================================================
void pit_delay_ms(uint8 ch, uint32 ms) {
	pit_delay_us(ch, ms * 1000);
}
