////==============================================================
////文件名称：gyro_acce.h
////功能概要：陀螺仪、加速度传感器头文件
////版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
////==============================================================
//
//#ifndef  _GYRO_ACCE_H
//#define  _GYRO_ACCE_H
//
//#include "common.h"    //包含公共要素头文件
//#include "adc.h"
//#include <math.h>
//
////采样参数========================================================
//#define GYRO_ACCE_ADC		U_ADC0
//#define GYRO_CH				U_ADC0_SE17	//PTE24	X轴角速度引脚
//#define ACCE_CH				U_ADC0_SE18	//PTE25	Z轴加速度引脚
//#define GYRO_ACCE_ACC		(12)		//陀螺仪加速度传感器采样精度
//#define GYRO_ACCE_SMP		(16)		//陀螺仪加速度传感器采样次数
//#define GYRO_ACCE_PERIOD	(5)			//采样时间间隔，单位ms
//
////陀螺仪加速度传感器硬件参数=============================================
//#define GYRO_ACCE_VTG		(3.3)		//工作电压，单位V
//#define GYRO_MTP			(5.1)		//陀螺仪运算放大器倍数，无单位
//#define GYRO_SF				(0.67)		//陀螺仪比例因子，单位mV/°/s
//#define ACCE_RES			(0.8)		//加速度传感器分辨率，单位V/g
//
////根据陀螺仪加速度传感器初始状态确定========================================
//#define GYRO_SET   (0x07A8)	//角速度为0°/s时陀螺仪X轴角速度的AD值
////#define ACCE_SET   (0x0A7C)	//小车平衡时加速度传感器Z轴加速度的AD值,与硬件条件有关,且最好能保证传感器与地面垂直
//
////卡尔曼滤波因子===================================================
//#define Q_ANGLE         (0.001)		//0.001	由角速度积分获得的角度的不确定度,值越大波形越与实际值贴合
//#define Q_GYRO          (0.003)		//0.003	角速度漂移值的不确定度,值越大向真实值回归的速度越快
//#define R_ANGLE         (0.5)		//0.5	由加速度获得的角度的不确定度,值越小波形越与实际值贴合
//
////==============================================================
////函数名称：gyro_acce_init
////函数返回：无
////参数说明：无
////功能概要：陀螺仪、加速度传感器初始化。调用AD构件完成对陀螺仪、加速
////度传感器的MCU采样引脚的初始化，无需参数。
////==============================================================
//void gyro_acce_init(void);
//
////==============================================================
////函数名称：gyro_acce_getAD
////函数返回：无
////参数说明：angle_speed_AD:存放陀螺仪X轴角速度AD值的指针，该值往前倾增大，往后倾减小
////		 acce_speed_AD:存放加速度传感器Z轴加速度AD值的指针，该往前倾减小，往后倾增大
////功能概要：获取陀螺仪、加速度传感器AD数据。调用AD构件完成对陀螺仪、
////加速度传感器的MCU采样引脚的电平采样。
////==============================================================
//void gyro_acce_getAD(uint16_t *angle_speed_AD, uint16_t *acce_speed_AD);
//
////==============================================================
////函数名称：gyro_acce_AD_to_phy
////函数返回：无
////参数说明：angle_speed_AD:陀螺仪X轴角速度AD值
////		 acce_speed_AD:加速度传感器Z轴加速度AD值
////       angle_speed:存放陀螺仪角速度的指针，单位°/s，往前倾值增大，往后倾值减小
////       acce_speed:存放加速度传感器加速度的指针，单位g，往前倾值增大，往后倾值减小
////功能概要：陀螺仪、加速度传感器的采样电压值转成角速度、加速度。
////==============================================================
//void gyro_acce_AD_to_phy(uint16_t angle_speed_AD, uint16_t acce_speed_AD,
//		float *angle_speed, float *acce_speed, uint16_t acce_set);
//
////==============================================================
////函数名称：gyro_acce_phy_to_angle
////函数返回：无
////参数说明： angle_speed:角速度，单位°/s
////       acce_speed:加速度，单位g
////       angle:通过卡尔曼滤波所获得的倾角
////		 angle_speed_new:通过卡尔曼滤波所获得的角速度
////功能概要：利用卡尔曼滤波把角速度、加速度转成车模倾角。
////==============================================================
//void gyro_acce_phy_to_angle(float angle_speed, float acce_speed, float *angle,
//		float *angle_speed_new);
//
//#endif
//
