//===========================================================================
//文件名称：ems.h
//功能概要：电磁传感器驱动构件源文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//版    本：V1.0, 20151110
//===========================================================================

#ifndef _EMS_H
#define _EMS_H

//包含头文件
#include "common.h"
#include "adc.h"

//电磁传感器使用ADC模块号
#define EMS_ADC   U_ADC0

//AD通道,通道对应引脚硬件连接，对于不同芯片，可查看芯片手册修改通道对应的引脚号
#define EMS_CH0   U_ADC0_SE8    //PTB0
#define EMS_CH1   U_ADC0_SE9    //PTB1
#define EMS_CH2   U_ADC0_SE12   //PTB2
#define EMS_CH3   U_ADC0_SE13   //PTB3

//采样参数=======================================================================
#define EMS_ACC		(12)		//电磁传感器采样精度
#define EMS_SMP		(8)			//电磁传感器采样次数
#define EMS_PERIOD	(20)		//采样时间间隔，单位ms

//电磁传感器硬件参数=============================================
#define EMS_VTG		(5)		//工作电压，单位V

//=================================================================================
//函数名称：ems_init
//函数返回：无
//参数说明：无
//功能概要：电磁传感器初始化
//=================================================================================
void ems_init(void);

//===================================================================================
//函数名称： ems_get_phy
//函数返回：无
//参数说明：EMS_V:储存电磁传感器电压值的数组，单位V
//功能概要：采集4路传感器的值，存放到数组EMS_V中
//===================================================================================
void ems_get_phy(float *EMS_V);

//==============================================================
//函数名称：ems_AD_to_phy
//函数返回：无
//参数说明：EMS_AD:传感器采样AD值
//		   EMS_V:传感器采样物理值，单位V
//功能概要：将传感器的AD值转化成物理值
//==============================================================
void ems_AD_to_phy(uint16_t EMS_AD, float *EMS_V);

#endif

