////=================================================================================
////文件名称：ems.c
////功能概要：电磁传感器驱动构件源文件
////版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
////版    本：V1.0, 20151111
////=================================================================================
//
//#include "ems.h"
//
////=================================================================================
////函数名称：ems_init
////函数返回：无
////参数说明：无
////功能概要：电磁传感器初始化
////=================================================================================
//void ems_init(void)
//{
//	adc_init(EMS_ADC);       //K60与KL25的差距，固定使用模块号0，可能需要更改
//}
//
////===================================================================================
////函数名称： ems_get_phy
////函数返回：无
////参数说明：EMS_V:储存电磁传感器电压值的数组，单位V
////功能概要：采集4路传感器的值，存放到数组EMS_V中
////===================================================================================
//void ems_get_phy(float *EMS_V)
//{
//	uint8_t i, j;
//	uint32_t EMS_AD_sum;
//	uint16_t EMS_AD_temp;
//	uint8 max, min;
//	uint8 EMS_CH[4] = { EMS_CH0, EMS_CH1, EMS_CH2, EMS_CH3 };
//	//存放AD采样数据
//	uint16_t AD_data[4][5];
//
//	//采集4路传感器AD值
//	for (i = 0; i < 4; i++)
//	{
//		for (j = 0; j < 5; j++)
//		{
//			AD_data[i][j] = adc_ave(EMS_ADC, EMS_CH[i], EMS_ACC, EMS_SMP); //从左到右第i号传感器
//		}
//	}
//
//	//更新第一次采集的数据
//	for (i = 0; i < 4; i++)
//	{
//		AD_data[i][0] = adc_ave(EMS_ADC, EMS_CH[i], EMS_ACC, EMS_SMP); //从左到右第i号传感器
//	}
//
//	for (i = 0; i < 4; i++)
//	{
//		max = min = 0;
//		EMS_AD_sum = 0;
//		for (j = 0; j < 5; j++)
//		{
//			if (AD_data[i][j] < AD_data[i][min])
//				min = j;
//			if (AD_data[i][j] > AD_data[i][max])
//				max = j;
//			EMS_AD_sum += AD_data[i][j];
//		}
//		//去除最大最小值
//		EMS_AD_temp = (EMS_AD_sum - AD_data[i][min] - AD_data[i][max]) / 3;
//		//转化为物理电压值
//		ems_AD_to_phy(EMS_AD_temp, &EMS_V[i]);
//	}
//
//}
//
////==============================================================
////函数名称：ems_AD_to_phy
////函数返回：无
////参数说明：EMS_AD:传感器采样AD值
////		   EMS_V:传感器采样物理值，单位V
////功能概要：将传感器的AD值转化成物理值
////==============================================================
//void ems_AD_to_phy(uint16_t EMS_AD, float *EMS_V)
//{
//	//电磁传感器电压
//	*EMS_V = (EMS_AD * 1.0) * EMS_VTG / (1 << EMS_ACC);
//}
