//==========================================================================
//文件名称：custom.h
//功能概要：用户自定义软件程序头文件
//==========================================================================

#ifndef _CUSTOM_H
#define _CUSTOM_H

#include "common.h"

//==========================================================================
//函数名称: custom_oled_display_init
//函数返回: 无
//参数说明: 无
//功能概要: 初始化OLED显示内容
//==========================================================================
void custom_oled_display_init();

//==========================================================================
//函数名称: custom_oled_update_temp
//函数返回: 无
//参数说明: 无
//功能概要: 更新OLED显示温度值
//==========================================================================
void custom_oled_update_temp();

//==========================================================================
//函数名称: custom_oled_show_img
//函数返回: 无
//参数说明: img:宽*高为80*60的图像首地址
//功能概要: 在OLED上显示一幅80*60的二值化图像
//备注: 显示的起始位置为第24列，第1页的第4行;
//     图像上方的4行被设置为全暗，但中间2列被设置为亮，用于指示图像的中心线;
//     显示一幅图像需1.2ms
//==========================================================================
void custom_oled_show_img(uint8 img[60][80]);

#endif
