//==========================================================================
//文件名称：custom.h
//功能概要：用户自定义软件程序头文件
//==========================================================================

#ifndef _CUSTOM_H
#define _CUSTOM_H

#include "common.h"
#include "uart.h"
#include "param.h"

//定义所使用的UART模块号，需要使能该模块，才可以使用本文件提供的函数
#define CUSTOM_UART_MOD	UART_MOD0	//UART0

//定义主机地址，为帧的目的地址
#define CUSTOM_HOST_ADDR	(255)
//定义字符串帧类型
#define CUSTOM_FRAME_TYPE_STRING	(0)
//定义小车参数帧类型
#define CUSTOM_FRAME_TYPE_PARAM	(1)
//定义原始图像帧类型，共用3帧
#define CUSTOM_FRAME_TYPE_RAW_IMG0	(2)
#define CUSTOM_FRAME_TYPE_RAW_IMG1	(3)
#define CUSTOM_FRAME_TYPE_RAW_IMG2	(4)
//定义中点帧类型
#define CUSTOM_FRAME_TYPE_MID_POINT	(5)
//定义边缘帧类型
#define CUSTOM_FRAME_TYPE_EDGE		(6)

//==========================================================================
//函数名称: custom_oled_display_init
//函数返回: 无
//参数说明: 无
//功能概要: 初始化OLED显示内容
//==========================================================================
void custom_oled_display_init();

//==========================================================================
//函数名称: custom_oled_update_temp
//函数返回: 无
//参数说明: 无
//功能概要: 更新OLED显示温度值
//==========================================================================
void custom_oled_update_temp();

//==========================================================================
//函数名称: custom_oled_show_img
//函数返回: 无
//参数说明: img:宽*高为80*60的图像首地址
//功能概要: 在OLED上显示一幅80*60的二值化图像
//备注: 显示的起始位置为第48列，第1页的第4行;
//     图像上方的4行被设置为全暗，但中间2列被设置为亮，用于指示图像的中心线;
//     显示一幅图像需1ms
//==========================================================================
void custom_oled_show_img(uint8 img[60][80]);

//==========================================================================
//函数名称: custom_send_string_to_host
//函数返回: true:发送成功; false:发送失败，即字符串长度大于等于255个字节
//参数说明: str:字符串的首地址
//功能概要: 发送字符串至上位机
//备注: 组帧发送
//==========================================================================
bool custom_send_string_to_host(const uint8* str);

//==========================================================================
//函数名称: custom_send_param_to_host
//函数返回: 无
//参数说明: car:小车参数的地址
//功能概要: 发送小车参数至上位机
//备注: 组帧发送
//==========================================================================
void custom_send_param_to_host(const ParamCar* car);

//==========================================================================
//函数名称: custom_send_raw_img_to_host
//函数返回: 无
//参数说明: raw_img:600个字节的原始图片首地址
//功能概要: 发送原始图片至上位机
//备注: 组帧发送，共3帧
//==========================================================================
void custom_send_raw_img_to_host(const uint8 raw_img[600]);

//==========================================================================
//函数名称: custom_send_mid_points_to_host
//函数返回: 无
//参数说明: mid_points:60个字节的中点数组的首地址
//         valid_row:60个字节的该行是否有效数组的首地址
//功能概要: 发送中点信息至上位机
//备注: 组帧发送
//==========================================================================
void custom_send_mid_points_to_host(const int16 mid_points[60],
		const bool valid_row[60]);

//==========================================================================
//函数名称: custom_send_edges_to_host
//函数返回: 无
//参数说明: left_edges:60个字节的左边缘数组的首地址
//         right_edges:60个字节的右边缘数组的首地址
//         valid_row:60个字节的该行是否有效数组的首地址
//功能概要: 发送边缘信息至上位机
//备注: 组帧发送
//==========================================================================
void custom_send_edges_to_host(const int16 left_edges[60],
		const int16 right_edges[60], const bool valid_row[60]);

#endif
