//==========================================================================
//文件名称：pit.h
//功能概要：KL25 pit底层驱动程序头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2016-3-20   V4.0
//==========================================================================

#ifndef _PIT_H
#define _PIT_H

#include "common.h"

//可使用的PIT通道号
#define PIT_CH0	(0)
#define PIT_CH1	(1)

//工作频率（这里要加括号，之前的程序没有加，在计算时候乘法溢出导致程序异常）
#define PIT_WORK_FREQ    (BUS_CLK_KHZ)

//==========================================================================
//函数名称: pit_init                                                         
//函数返回: 无                                          
//参数说明: PIT_CHn:PIT模块的通道号，PIT_CH0或PIT_CH1。
//         int_ms:中断周期，以ms为单位。系统总线时钟为24MHz，最大值为178956ms
//功能概要: PIT模块初始化。
//==========================================================================
void pit_init(uint_8 PIT_CHn, uint_32 int_ms);

//==========================================================================
//函数名称: pit_enable_int
//参数说明: PIT_CHn:PIT模块的通道号，PIT_CH0或PIT_CH1。
//函数返回: 无
//功能概要: 使能某一通道的PIT中断。
//==========================================================================
void pit_enable_int(uint_8 PIT_CHn);

//==========================================================================
//函数名称: pit_disable_int
//参数说明: PIT_CHn:PIT模块的通道号，PIT_CH0或PIT_CH1。
//函数返回: 无
//功能概要: 禁止某一通道的PIT中断。
//==========================================================================
void pit_disable_int(uint_8 PIT_CHn);

//==========================================================================
//函数名称: pit_get_int
//参数说明: PIT_CHn:PIT模块的通道号，PIT_CH0或PIT_CH1。
//函数返回: 中断标志 1=有中断产生;0=无中断产生
//功能概要: 获取某一通道的PIT中断状态。
//==========================================================================
uint_8 pit_get_int(uint_8 PIT_CHn);

//==========================================================================
//函数名称: pit_clear_int
//参数说明: PIT_CHn:PIT模块的通道号，PIT_CH0或PIT_CH1。
//函数返回: 无
//功能概要: 清除某一通道的PIT中断标志。
//==========================================================================
void pit_clear_int(uint_8 PIT_CHn);

#endif

//===========================================================================
//声明：
//（1）我们开发的源代码，在本中心提供的硬件系统测试通过，真诚奉献给社会，不足之处，
//     欢迎指正。
//（2）对于使用非本中心硬件系统的用户，移植代码时，请仔细根据自己的硬件匹配。
//
//苏州大学飞思卡尔嵌入式中心（苏州华祥信息科技有限公司）
//技术咨询：0512-65214835  http://sumcu.suda.edu.cn
//业务咨询：0512-87661670,18915522016  http://www.hxtek.com.cn
