//==========================================================================
//文件名称：rng.c
//功能概要：K64 RNG底层驱动程序源文件
//==========================================================================

#include "rng.h"

//==========================================================================
//函数名称: rng_init
//函数返回: 无
//参数说明: 无
//功能概要: 初始化RNG模块
//==========================================================================
void rng_init() {
	//开RNG模块时钟门
	REG_SET_MASK(SIM_SCGC3, SIM_SCGC3_RNGA_MASK);
	REG_SET_MASK(SIM_SCGC6, SIM_SCGC6_RNGA_MASK);
	//使能随机数发生器
	REG_SET_MASK(RNG_CR, RNG_CR_GO_MASK | RNG_CR_HA_MASK | RNG_CR_INTM_MASK);
}

//==========================================================================
//函数名称: rng_next_uint32
//函数返回: 32位随机数
//参数说明: 无
//功能概要: 生成一个32位随机数
//==========================================================================
uint32 rng_next_uint32() {
	//等待随机数产生
	while (!(REG_GET_MASK(RNG_SR, RNG_SR_OREG_LVL_MASK))) {
	}
	//返回生成的随机数
	return RNG_OR;
}

//==========================================================================
//函数名称: rng_next_uint16
//函数返回: 16位随机数
//参数说明: 无
//功能概要: 生成一个16位随机数
//==========================================================================
uint16 rng_next_uint16() {
	return rng_next_uint32();
}

//==========================================================================
//函数名称: rng_next_uint8
//函数返回: 8位随机数
//参数说明: 无
//功能概要: 生成一个8位随机数
//==========================================================================
uint8 rng_next_uint8() {
	return rng_next_uint32();
}

//==========================================================================
//函数名称: rng_next_bool
//函数返回: true或false
//参数说明: 无
//功能概要: 生成true或false
//==========================================================================
bool rng_next_bool() {
	return rng_next_uint32() & 0x1 ? true : false;
}

//==========================================================================
//函数名称: rng_next_bytes
//函数返回: 无
//参数说明: bytes:存储随机字节数组的首地址
//         len:随机字节数组的长度
//功能概要: 生成一定长度的随机字节数组
//==========================================================================
void rng_next_bytes(uint8* bytes, uint32 len) {
	uint32* ptr32;	//32位指针
	uint32 temp;	//临时变量

	ptr32 = (uint32*) bytes;	//指向字节数组首地址
	//生成满4字节的随机数
	for (; len >= 4; len -= 4) {
		*ptr32++ = rng_next_uint32();
	}
	bytes = (uint8*) ptr32;	//指向剩余字节首地址
	//生成剩余随机数
	switch (len) {
	case 3:	//剩余3字节
		//获取32位随机数
		temp = rng_next_uint32();
		//填充前2个字节
		*(uint16*) bytes = (uint16) temp;
		//填充最后一个字节
		*(bytes + 2) = temp >> 16;
		break;
	case 2:	//剩余2字节
		*(uint16*) bytes = rng_next_uint16();
		break;
	case 1:	//剩余1字节
		*bytes = rng_next_uint8();
		break;
	}
}
