//==========================================================================
//文件名称：menu.h
//功能概要：菜单功能程序源文件
//==========================================================================

#ifndef _MENU_H
#define _MENU_H

#include "common.h"
#include "param.h"
#include "oled.h"

#define MENU_MAX_ROW	(OLED_PAGE_NUM / 2) //一个字符占用2页
#define MENU_BUF_SIZE  	(8) //缓冲区大小
#define MENU_PARAM_NUM	(9) //参数个数

//==========================================================================
//函数名称: menu_init
//函数返回: 无
//参数说明: param：存储参数值的首地址
//功能概要: 菜单内容初始化，进入菜单参数选择模式
//==========================================================================
void menu_init(ParamCarPtr param);

//==========================================================================
//函数名称: menu_accept
//函数返回: 无
//参数说明: ch:输入的字符
//功能概要: 接受输入的字符，放入缓冲区并显示，若菜单中没有参数则直接返回
//==========================================================================
void menu_accept(uint8 ch);

//==========================================================================
//函数名称: menu_can_show_img
//函数返回: 无
//参数说明: 无
//功能概要: 表示屏幕是否可以显示图像，true：处于菜单图像模式，可以显示；
//                                false：菜单为其他模式，不可以显示
//==========================================================================
bool menu_can_show_img();

#endif
