//==========================================================================
//文件名称：menu.h
//功能概要：用户自定义软件程序头文件
//==========================================================================

#ifndef _MENU_H
#define _MENU_H

#include "common.h"

#define STARTING_COL  (0) //菜单的起始列号
#define STARTING_PAGE (0) //菜单的起始页号
#define MAX_ROW       (4) //最大行号
#define BUF_SIZE      (8) //缓冲区大小

//==========================================================================
//函数名称: menu_oled_init
//函数返回: 无
//参数说明: 无
//功能概要: 菜单内容初始化
//==========================================================================
void menu_oled_init(void);

//==========================================================================
//函数名称: menu_oled_accept
//函数返回: 无
//参数说明: ch:输入的字符
//功能概要: 接受输入的字符，放入缓冲区并显示
//==========================================================================
void menu_oled_accept(uint8 ch);

#endif
