//==========================================================================
//文件名称：frame_bytes.h
//功能概要：组帧通信协议字节数组组件程序头文件
//==========================================================================

#ifndef _FRAME_BYTES_H
#define _FRAME_BYTES_H

#include "common.h"
#include "frame.h"

//==========================================================================
//说明: 帧的<数据>字段存储的是一个字节数组;
//     字节数组长度不能超过255字节;
//     允许存储空字节数组;
//传输顺序: 字节数组低字节-字节数组高字节，如:b[5]，最先传输b[0]，最后传输b[4]
//==========================================================================

//定义字节数组组件所使用的帧类型，不能与其他组件冲突
#define FRAME_BYTES_TYPE	(0x01)

//==========================================================================
//函数名称: frame_bytes_send
//函数返回: 无
//参数说明: bytes:要发送的字节数组首地址
//         len:字节数组长度
//功能概要: 发送一定长度的字节数组，自动组装帧信息结构体
//备注: 需先使能组帧通信协议
//==========================================================================
void frame_bytes_send(uint8* bytes, uint8 len);

//==========================================================================
//函数名称: frame_bytes_parse
//函数返回: true:解析成功; false:解析失败，即帧类型错误
//参数说明: info:要解析的帧信息结构体
//         bytes:存储字节数组的首地址
//         len:存储字节数组长度的地址
//功能概要: 解析帧信息结构体，解析成功时，存储相应参数
//==========================================================================
bool frame_bytes_parse(FrameInfo info, uint8* bytes, uint8* len);

#endif
