//==========================================================================
//文件名称：frame_bytes.c
//功能概要：组帧通信协议字节数组组件程序源文件
//==========================================================================

#include "frame_bytes.h"

//==========================================================================
//函数名称: frame_bytes_send
//函数返回: true:发送成功; false:发送失败，即发送帧信息结构体失败
//参数说明: bytes:要发送的字节数组首地址
//         len:字节数组长度
//功能概要: 发送一定长度的字节数组，自动组装帧信息结构体
//备注: 需先使能组帧通信协议
//==========================================================================
bool frame_bytes_send(uint8* bytes, uint8 len) {
	FrameInfo info;	//要发送的帧信息结构体
	uint8 i;		//游标
	//设置类型
	info.type = FRAME_BYTES_TYPE;
	//设置数据长度
	info.len = len;
	//拷贝数据
	for (i = 0; i < len; i++) {
		info.data[i] = bytes[i];
	}
	//发送帧信息结构体
	return frame_send_info(info);
}

//==========================================================================
//函数名称: frame_bytes_parse
//函数返回: true:解析成功; false:解析失败，即帧类型错误
//参数说明: info:要解析的帧信息结构体
//         bytes:存储字节数组的首地址
//         len:存储字节数组长度的地址
//功能概要: 解析帧信息结构体，解析成功时，存储相应参数
//==========================================================================
bool frame_bytes_parse(FrameInfo info, uint8* bytes, uint8* len) {
	uint8 i;	//游标
	//检验帧类型是否正确
	if (info.type != FRAME_BYTES_TYPE) {
		return false;
	}
	//存储字节数组
	for (i = 0; i < info.len; i++) {
		bytes[i] = info.data[i];
	}
	//存储字节数组长度
	*len = info.len;
	return true;
}
